search-petstore.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns="http://www.w3.org/2005/xpath-functions">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <petstore xmlns="http://petstore.solo.io">
         <pet-search/>
      </petstore>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>